In [1]:
import pandas as pd

In [25]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'Gender': ['F', 'M', 'M', 'M', 'F'],
    'Score': [85, 90, 95, 80, 75]
}

df = pd.DataFrame(data)

In [3]:
df

      Name  Age Gender  Score
0    Alice   25      F     85
1      Bob   30      M     90
2  Charlie   35      M     95
3    David   40      M     80
4      Eva   45      F     75

In [4]:
# 1st problem printing first 3 rows
df.loc[0:2]

      Name  Age Gender  Score
0    Alice   25      F     85
1      Bob   30      M     90
2  Charlie   35      M     95
3    David   40      M     80

In [5]:
# 2nd problem check shape,column and datatype
df.shape

(5, 4)

In [6]:
df.columns

Index(['Name', 'Age', 'Gender', 'Score'], dtype='object')

In [8]:
type(df)

pandas.core.frame.DataFrame

In [10]:
# 3rd problem get summary of dataframe
df.describe()

             Age      Score
count   5.000000   5.000000
mean   35.000000  85.000000
std     7.905694   7.905694
min    25.000000  75.000000
25%    30.000000  80.000000
50%    35.000000  85.000000
75%    40.000000  90.000000
max    45.000000  95.000000

In [12]:
#4th problem filter row 
#method 1
df[df["Score"]>70]

      Name  Age Gender  Score
0    Alice   25      F     85
1      Bob   30      M     90
2  Charlie   35      M     95
3    David   40      M     80
4      Eva   45      F     75

In [16]:
#method 2
df.query("Score >70")

      Name  Age Gender  Score
0    Alice   25      F     85
1      Bob   30      M     90
2  Charlie   35      M     95
3    David   40      M     80
4      Eva   45      F     75

In [27]:
# 5th problem Adding new column 
df["Pass"]=df["Score"].apply(lambda x: "True" if x>=80 else "False")

In [28]:
df

      Name  Age Gender  Score   Pass
0    Alice   25      F     85   True
1      Bob   30      M     90   True
2  Charlie   35      M     95   True
3    David   40      M     80   True
4      Eva   45      F     75  False

In [37]:
#6th problem change Score column name to Marks
df.rename(columns={"Score":"Marks"})

      Name  Age Gender  Marks   Pass
0    Alice   25      F     85   True
1      Bob   30      M     90   True
2  Charlie   35      M     95   True
3    David   40      M     80   True
4      Eva   45      F     75  False

In [42]:
#7th problem drop column
df.drop(columns=["Gender"],inplace=True)

In [43]:
df

      Name  Age  Score   Pass
0    Alice   25     85   True
1      Bob   30     90   True
2  Charlie   35     95   True
3    David   40     80   True
4      Eva   45     75  False